case/tube_3case/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(   
( 0.00424264068712 0.00424264068712 0.0 )
( -0.00424264068712 0.00424264068712 0.0 )
( -0.00424264068712 -0.00424264068712 0.0 )
( 0.00424264068712 -0.00424264068712 0.0 )
( 0.00353553390593 0.00353553390593 0.0 )
( -0.00353553390593 0.00353553390593 0.0 )
( -0.00353553390593 -0.00353553390593 0.0 )
( 0.00353553390593 -0.00353553390593 0.0 )
( 0.00424264068712 0.00424264068712 0.05 )
( -0.00424264068712 0.00424264068712 0.05 )
( -0.00424264068712 -0.00424264068712 0.05 )
( 0.00424264068712 -0.00424264068712 0.05 )
( 0.00353553390593 0.00353553390593 0.05 )
( -0.00353553390593 0.00353553390593 0.05 )
( -0.00353553390593 -0.00353553390593 0.05 )
( 0.00353553390593 -0.00353553390593 0.05 )
);

blocks
(    
hex ( 5 4 0 1 13 12 8 9 ) (26 6 166 ) simpleGrading ( 1 1 1 )
hex ( 2 6 5 1 10 14 13 9 ) (6 26 166 ) simpleGrading ( 1 1 1 )
hex ( 2 3 7 6 10 11 15 14 ) (26 6 166 ) simpleGrading ( 1 1 1 )
hex ( 7 3 0 4 15 11 8 12 ) (6 26 166 ) simpleGrading ( 1 1 1 )
);

edges
(
arc 0 1 (0.0 0.006 0.0 ) 
arc 1 2 (-0.006 0.0 0.0 ) 
arc 2 3 (0.0 -0.006 0.0 ) 
arc 3 0 (0.006 0.0 0.0 ) 
arc 4 5 (0.0 0.005 0.0 ) 
arc 5 6 (-0.005 0.0 0.0 ) 
arc 6 7 (0.0 -0.005 0.0 ) 
arc 7 4 (0.005 0.0 0.0 ) 
arc 8 9 (0.0 0.006 0.05 ) 
arc 9 10 (-0.006 0.0 0.05 ) 
arc 10 11 (0.0 -0.006 0.05 ) 
arc 11 8 (0.006 0.0 0.05 ) 
arc 12 13 (0.0 0.005 0.05 ) 
arc 13 14 (-0.005 0.0 0.05 ) 
arc 14 15 (0.0 -0.005 0.05 ) 
arc 15 12 (0.005 0.0 0.05 ) 
);

patches
(      
wall inlet
(
( 5 1 0 4 )
( 2 1 5 6 )
( 2 6 7 3 )
( 7 4 0 3 )
)

wall outlet
(
( 13 12 8 9 )
( 10 14 13 9 )
( 10 11 15 14 )
( 15 11 8 12 )
)

wall wall
(
( 0 1 9 8 )
( 2 10 9 1 )
( 3 11 10 2 )
( 3 0 8 11 )
)

wall fsiface
(
( 4 12 13 5 )
( 6 5 13 14 )
( 7 6 14 15 )
( 7 15 12 4 )
)

);

mergePatchPairs
(
);

// ************************************************************************* //