case/tube_3case/constant/time-series
(
(0 4 )
(0.0001 4 )
(0.0002 4 )
(0.0003 4 )
(0.0004 4 )
(0.0005 4 )
(0.0006 4 )
(0.0007 4 )
(0.0008 4 )
(0.0009 4 )
(0.001 4 )
(0.0011 4 )
(0.0012 4 )
(0.0013 4 )
(0.0014 4 )
(0.0015 4 )
(0.0016 4 )
(0.0017 4 )
(0.0018 4 )
(0.0019 4 )
(0.002 4 )
(0.0021 4 )
(0.0022 4 )
(0.0023 4 )
(0.0024 4 )
(0.0025 4 )
(0.0026 4 )
(0.0027 4 )
(0.0028 4 )
(0.0029 4 )
(0.003 4 )
(0.0031 0 )
(0.0032 0 )
(0.0033 0 )
(0.0034 0 )
(0.0035 0 )
(0.0036 0 )
(0.0037 0 )
(0.0038 0 )
(0.0039 0 )
(0.004 0 )
(0.0041 0 )
(0.0042 0 )
(0.0043 0 )
(0.0044 0 )
(0.0045 0 )
(0.0046 0 )
(0.0047 0 )
(0.0048 0 )
(0.0049 0 )
(0.005 0 )
(0.0051 0 )
(0.0052 0 )
(0.0053 0 )
(0.0054 0 )
(0.0055 0 )
(0.0056 0 )
(0.0057 0 )
(0.0058 0 )
(0.0059 0 )
(0.006 0 )
(0.0061 0 )
(0.0062 0 )
(0.0063 0 )
(0.0064 0 )
(0.0065 0 )
(0.0066 0 )
(0.0067 0 )
(0.0068 0 )
(0.0069 0 )
(0.007 0 )
(0.0071 0 )
(0.0072 0 )
(0.0073 0 )
(0.0074 0 )
(0.0075 0 )
(0.0076 0 )
(0.0077 0 )
(0.0078 0 )
(0.0079 0 )
(0.008 0 )
(0.0081 0 )
(0.0082 0 )
(0.0083 0 )
(0.0084 0 )
(0.0085 0 )
(0.0086 0 )
(0.0087 0 )
(0.0088 0 )
(0.0089 0 )
(0.009 0 )
(0.0091 0 )
(0.0092 0 )
(0.0093 0 )
(0.0094 0 )
(0.0095 0 )
(0.0096 0 )
(0.0097 0 )
(0.0098 0 )
(0.0099 0 )
(0.01 0 )
)
