case/tube_3case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{   
    inlet
    {
        type             timeVaryingUniformFixedValue;
        value            uniform 0;
        outOfBounds      clamp;
        fileName        "$FOAM_CASE/constant/time-series";
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    fsiface
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
