case/tube_3case/0/solid/DU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      DU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }

    outlet
    {     
      type            fixedValue;
      value           uniform (0 0 0);
    }

    wall
    {     
      type            solidTractionFree;
      nonLinear       updatedLagrangian;
      value           uniform (0 0 0);
    }

    fsiface
    {
        type solidTraction;
	nonLinear updatedLagrangian;
        traction uniform ( 0 0 0 );
        pressure uniform 0;
        value uniform (0 0 0);
    }    
}

// ************************************************************************* //
