case/tube_3case/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default     Euler;
}

ddtSchemes
{
    default     none;
//    ddt(DU)     Euler;
    ddt(DU)     backward;
}

gradSchemes
{
    default         none;
    grad(DU)        extendedLeastSquares 0;
    grad(Us)        extendedLeastSquares 0;
    snGradCorr(DU)  extendedLeastSquares 0;
}

divSchemes
{
    default         none;
    div(sigma)      Gauss linear;
}

laplacianSchemes
{
    default         	none;
    laplacian(DDU,DU) 	Gauss linear corrected;
}

snGradSchemes
{
    default none;
//    snGrad(U)       corrected;
}

interpolationSchemes
{
    default                linear;
    interpolate(sigma)     linear;
    interpolate(mu)        linear;
}

// ************************************************************************* //
