case/tube_3case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };

    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };

    T
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    }

    cellMotionU
    {
	solver          GAMG;
        tolerance        1e-6;
       	relTol           1e-3;
       	minIter          1;
       	maxIter          1000;
        smoother         GaussSeidel;
       	nPreSweeps       0;
       	nPostSweeps      2;
       	nFinestSweeps    2;	
        scaleCorrection true;
       	directSolveCoarsest false;			   		
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator     faceAreaPair;
	mergeLevels      1;
        };
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

}


PISO
{
    nCorrectors     10;
    nNonOrthogonalCorrectors 2;
    nOuterCorrectors 30;
    ddtPhiCorr no;
    momentumPredictor no;
}

fsi
{
    dim       3;  
    pythonCommand "python mainFsi.py";   
    clearCommand  "rm -rf fsi/*"; 
    maxNumForIQN-ILS 10;
    startRelaxFactor 0.02;
    maxRelaxFactor   0.5;
}  

statistics
{
    calculateLiftAndDrag no;
}
// ************************************************************************* //
